benchbnb/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "c7lOMEHwzIz8G0p8qQEC0g"], ["updated_at", "2018-10-08 23:42:00.800860"], ["id", 2]]
---
  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.save!